## Name: Bassam Nazer
## Reg no: 22-27-07
## Date: 17/04/2023

In [1]:
import numpy as np
import pandas as pd

1. Read the housingdata.csv file into pandas DataFrame and display first six rows of the
 DataFrame

In [2]:
df = pd.read_csv("C:\\Users\\bassa\\Downloads\\housingdata.csv")
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

2. Display the column names and row index in separate cells.

In [3]:
for col in df.columns:
    print(col)

PID
STATE
PRICE
NUM_BEDROOMS
NUM_BATH
SQ_FT

In [4]:
for row in df.index:
    print(row, end = " ")

0 1 2 3 4 5 6 7 8

3a. How many numbers of “STATE” exist in the dataset. Hint: use shape

In [5]:
df['STATE'].shape[0]

9

3b. How many unique states exist in the dataset

In [6]:
df['STATE'].nunique()

6

4. Retrieve the list of all NaN/Null/Empty cells in the form of Boolean list

In [7]:
df.isnull()

     PID  STATE  PRICE  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False  False  False         False     False  False
1  False  False  False         False     False  False
2  False  False  False          True     False  False
3  False  False  False         False      True  False
4   True  False  False         False     False  False
5  False  False  False          True     False  False
6  False  False  False         False     False  False
7  False  False  False         False     False   True
8  False  False  False         False     False  False

5. Drop all rows with N/A,NA,na values in Num_Bedrooms

In [8]:
df.replace(to_replace=['na'], value=np.nan, inplace=True)
df.dropna(subset=['NUM_BEDROOMS'])

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

6. Replace the NaN and String entries in Num_Bath with previous entry

In [9]:
df['NUM_BATH']= pd.to_numeric(df['NUM_BATH'], errors='coerce')

In [10]:
df['NUM_BATH'].fillna(method='ffill')

0    1.0
1    1.5
2    1.0
3    1.0
4    2.0
5    1.0
6    1.0
7    1.0
8    2.0
Name: NUM_BATH, dtype: float64

7. Replace the empty values in “SQ_FT” with the mean of the all entries.

In [11]:
df['SQ_FT']= pd.to_numeric(df['SQ_FT'], errors='coerce')
df['SQ_FT'].fillna(value = df['SQ_FT'].mean(), inplace = True)

8. What is the sum of SQ_FT of all entries in the dataset.

In [12]:
df['SQ_FT'].sum()

9900.0

9. Add a new column “NUM_STORE” and with all the values as 1 for all rows

In [13]:
df['NUM_STORE'] = 1

10. Create a DataFrame containing all entries of TN state only

In [14]:
df2 = df[df['STATE'] == 'TN']
df2

           PID STATE      PRICE NUM_BEDROOMS  NUM_BATH   SQ_FT  NUM_STORE
3  100004000.0    TN     321321            1       NaN   700.0          1
4          NaN    TN  589465645            3       2.0  1600.0          1
5  100006000.0    TN   65465466          NaN       1.0   800.0          1

14. Create a DataFrame having SQ_FT area greater than 1000 and display the DataFrame

In [15]:
df3 = df[df['SQ_FT'] >= 1000]
df3

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1.0,1000.0,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1100.0,1
4,NaN,TN,589465645,3,2.0,1600.0,1
7,100008000.0,HP,23131,1,1.0,1100.0,1
8,100009000.0,HP,21212,NaN,2.0,1800.0,1

15. Create a DataFrame having only first Three columns and First Three rows

In [16]:
df.iloc[:3,:3]

           PID        STATE    PRICE
0  100001000.0           MP   321654
1  100002000.0  MAHARASHTRA    21325
2  100003000.0           AP  2541654

16. Display the state having highest average price per square foot of housing area.

In [22]:
df_avg = df.groupby(['STATE'])
df_sum = df_avg.sum()
df_sum

                     PID      PRICE  NUM_BATH   SQ_FT  NUM_STORE
STATE
AP           100003000.0    2541654       1.0   850.0          1
ASSAM        100007000.0    3222321       0.0   950.0          1
HP           200017000.0      44343       3.0  2900.0          2
MAHARASHTRA  100002000.0      21325       1.5  1100.0          1
MP           100001000.0     321654       1.0  1000.0          1
TN           200010000.0  655252432       3.0  3100.0          3

In [34]:
df_sum['AVG_PRICE'] = df_sum['PRICE'] / df_sum['SQ_FT']
df_avg2 = df_sum.sort_values(['AVG_PRICE'], ascending = False)
df_avg2

,PID,PRICE,NUM_BATH,SQ_FT,NUM_STORE,AVG_PRICE
STATE,,,,,,
TN,200010000.0,655252432,3.0,3100.0,3,211371.752258
ASSAM,100007000.0,3222321,0.0,950.0,1,3391.916842
AP,100003000.0,2541654,1.0,850.0,1,2990.181176
MP,100001000.0,321654,1.0,1000.0,1,321.654000
MAHARASHTRA,100002000.0,21325,1.5,1100.0,1,19.386364
HP,200017000.0,44343,3.0,2900.0,2,15.290690

In [46]:
df_avg3 = df_avg2.iloc[:1]
df_avg3.index

Index(['TN'], dtype='object', name='STATE')